'use strict';

const PREFIXES = [
  'а', 'ана', 'без', 'безо', 'бес', 'в', 'вз', 'взаимо', 'взо',
  'вне', 'внутри', 'во', 'воз', 'возо', 'вос', 'вс', 'все', 'вы', 'гипер',
  'гипо', 'до', 'еже', 'за', 'из', 'изо', 'ин', 'ис', 'испод', 'к', 'квази',
  'ко', 'кое', 'кой', 'ку', 'меж', 'междо', 'между', 'мета', 'мимо', 'на',
  'над', 'надо', 'наи', 'не', 'небез', 'небезо', 'небес', 'недо', 'нео',
  'ни', 'низ', 'низо', 'нис', 'о', 'об', 'обез', 'обезо', 'обес', 'обо',
  'обще', 'около', 'орто', 'от', 'ото', 'пан', 'пара', 'пере', 'по', 'под',
  'пода', 'подо', 'поза', 'после', 'пост', 'пра', 'пре', 'пред', 'предо',
  'при', 'про', 'против', 'противо', 'прото', 'раз', 'разо', 'рас', 'роз',
  'рос', 'с', 'сверх', 'со', 'среди', 'су', 'суб', 'супер', 'сыз', 'транс',
  'тре', 'у', 'через', 'черес', 'чрез', 'экс'
];

module.exports = PREFIXES;
